open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_cloud_runtime.c
/* SPDX-License-Identifier: Apache-2.0 */
#include "bk7258_cloud_runtime.h"
#include "bk7258_cloud_client.h"
#include "bk7258_voice_tls.h"
#include "bk7258_preferences.h"
#ifdef CONFIG_BK7258_VISION_SERVICE
#include "bk7258_vision_service.h"
#endif
#include <stdio.h>
#include <errno.h>
#include <netdb.h>
#include <stdlib.h>
#include <string.h>
#include <syslog.h>
#include <mbedtls/platform_util.h>
#if defined(CONFIG_BK7258_PROVISION_GATT) && defined(CONFIG_BK7258_PREFERENCES)
#define BKCLOUD_MEMORY_RUNTIME 1
#include "bk7258_cloud_memory.h"
#include <mbedtls/entropy.h>
#endif

enum memory_action_e { MEMORY_SAVE, MEMORY_READ_POLICY, MEMORY_DISABLE, MEMORY_ENABLE, MEMORY_DELETE };

struct bkcloud_runtime_s
{
  struct bkcloud_config_s config;
  struct bkvoice_config_s *trust;
  struct bkvoice_ptt_s *ptt;
  struct bkvoice_tls_s tls;
  struct bkcloud_history_s history;
  pthread_t worker;
  sem_t *wake;
  uint8_t *pcm;
  size_t pcm_size;
  char input[BKCLOUD_TEXT_MAX+1];
  char reply[BKCLOUD_TEXT_MAX+1];
  uint32_t epoch;
  int result;
  bool done;
  bool joinable;
  bool probe;
  bool ready;
  bool armed;
  bool pressed;
  bool automatic_capture;
  bool cancelled;
  bool cancel_requested;
  bool pending_history;
  bool memory_job;
  bool memory_bound;
  bool memory_restored;
  bool memory_enabled;
  bool memory_known;
  bool memory_uncertain;
  int memory_error;
  enum memory_action_e memory_action;
  uint8_t memory_owner[32];
  enum bk7258_persona_e persona;
};
static const char *persona_style(enum bk7258_persona_e persona)
{
  switch(persona)
    {
      case BK7258_PERSONA_PLAYFUL: return "语气活泼，适当开轻松的玩笑。";
      case BK7258_PERSONA_QUIET: return "语气安静克制，通常只回复一两句话。";
      case BK7258_PERSONA_SERIOUS: return "语气认真，直接回应问题，给出清楚的建议。";
      case BK7258_PERSONA_TSUNDERE_LITE: return "可以轻微俏皮地嘴硬，但保持尊重，不贬低或操控对方。";
      default: return "语气温柔，耐心倾听，不夸大亲密关系。";
    }
}
static void persona_prompt(struct bkcloud_runtime_s *r,char *prompt,size_t size)
{
#ifdef CONFIG_BK7258_PREFERENCES
  struct bk7258_preferences_s preferences;
  int ret=bk7258_preferences_get(&preferences);
  if(!ret && r->persona!=preferences.persona)
    {
      bkcloud_history_clear(&r->history);
      r->persona=preferences.persona;
    }
  else if(ret) syslog(LOG_WARNING,"BKVOICE CLOUD persona_load=%d cached=1\n",ret);
#endif
  snprintf(prompt,size,
      "你是傻妞，一个虚构的 AI 伴侣。用简短中文自然回答，不冒充真人。不能执行设备操作。%s",
      persona_style(r->persona));
}
#ifdef BKCLOUD_MEMORY_RUNTIME
static bool g_memory_policy_uncertain;
struct memory_io_s
{
  struct bkcloud_memory_policy_s *policy;
  uint8_t *bytes;
  size_t size;
  bool save;
  bool published;
  mbedtls_entropy_context *entropy;
};
static int memory_io(void *context)
{
  struct memory_io_s *io = context;
  if (io->save)
    {
      int ret = bkcloud_memory_save("/mnt/sdnand/shaniu-memory", io->policy,
          io->bytes, io->size, mbedtls_entropy_func, io->entropy);
      io->published = ret == 0 || ret == -EINPROGRESS;
      return ret;
    }
  return bkcloud_memory_restore("/mnt/sdnand/shaniu-memory", io->policy,
      io->bytes, BKCLOUD_HISTORY_BYTES, &io->size);
}
/* Only the joined cloud worker performs I/O. The owner loop never waits for
 * RPMsgFS/SD while handling buttons, configuration or cancellation.
 */
static int memory_process(struct bkcloud_runtime_s *r, bool save)
{
  struct bkcloud_memory_policy_s policy;
  struct memory_io_s io = {0};
  mbedtls_entropy_context entropy;
  if (!r->memory_bound) return 0;
  if (__atomic_load_n(&g_memory_policy_uncertain, __ATOMIC_ACQUIRE)) return -EINPROGRESS;
  int ret = bkcloud_memory_policy_load("/cpdata/shaniu/memory-policy",
                                       r->memory_owner, &policy);
  if (ret < 0) return ret;
  r->memory_enabled = policy.enabled;
  r->memory_known = true;
  if (!policy.enabled) goto done;
  io.bytes = calloc(1, BKCLOUD_HISTORY_BYTES);
  if (!io.bytes) { ret = -ENOMEM; goto done; }
  io.policy = &policy; io.save = save;
  mbedtls_entropy_init(&entropy); io.entropy = &entropy;
  if (save)
    ret = bkcloud_history_encode(&r->history, r->persona, io.bytes,
                                  BKCLOUD_HISTORY_BYTES, &io.size);
  if (!ret) ret = bk7258_preferences_with_storage(memory_io, &io);
  if (save && io.published && ret < 0) ret = -EINPROGRESS;
  /* No destination publication until unmount/release succeeded too. */
  if (!ret && !save)
    ret = bkcloud_history_decode(&r->history, r->persona, io.bytes, io.size);
  mbedtls_entropy_free(&entropy);
  mbedtls_platform_zeroize(io.bytes, BKCLOUD_HISTORY_BYTES); free(io.bytes);
  if (!save && ret == -ENOENT) ret = 0;
done:
  mbedtls_platform_zeroize(&policy, sizeof(policy));
  return ret;
}
#endif
static int capture_start(void *context, const struct bkvoice_turn_token_s *token)
{
  struct bkcloud_runtime_s *r=context; (void)token;
  if(!r->pcm) return -ENOMEM;
  r->pcm_size=0;return 0;
}
static int capture_audio(void *context, const struct bkvoice_turn_token_s *token,
                          const uint8_t *pcm, size_t size)
{
  struct bkcloud_runtime_s *r=context;(void)token;
  if(size>BKCLOUD_PCM_MAX-r->pcm_size) return -EFBIG;
  memcpy(r->pcm+r->pcm_size,pcm,size);r->pcm_size+=size;return 0;
}
static int capture_end(void *context, const struct bkvoice_turn_token_s *token)
{ (void)context;(void)token;return 0; }
static int capture_cancel(void *context, const struct bkvoice_turn_token_s *token,int why)
{ (void)context;(void)token;(void)why;return 0; }
static const struct bkvoice_capture_sink_ops_s capture_ops =
{capture_start,capture_audio,capture_end,capture_cancel};
static void wipe_audio(struct bkcloud_runtime_s *r)
{
  if(r->pcm) { mbedtls_platform_zeroize(r->pcm,BKCLOUD_PCM_MAX);free(r->pcm); }
  r->pcm=NULL;r->pcm_size=0;
}
static void wipe_text(struct bkcloud_runtime_s *r)
{
  mbedtls_platform_zeroize(r->input,sizeof(r->input));
  mbedtls_platform_zeroize(r->reply,sizeof(r->reply));
  r->pending_history=false;
}
static bool cancelled(struct bkcloud_runtime_s *r)
{
  return __atomic_load_n(&r->cancelled,__ATOMIC_ACQUIRE);
}
#ifdef CONFIG_BK7258_VISION_SERVICE
static bool camera_consent(const char *input)
{
  static const char first[] = "拍照看看";
  static const char second[] = "看看眼前";
  const char *begin = input;
  const char *end = input + strlen(input);

