open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_cloud_runtime.c
  while (begin < end && *begin == ' ') begin++;
  for (;;)
    {
      if (end > begin && end[-1] == ' ')
        {
          end--;
        }
      else if (end > begin && strchr(".!?,;:", end[-1]) != NULL)
        {
          end--;
        }
      else if (end - begin >= 3 &&
               (!memcmp(end - 3, "。", 3) || !memcmp(end - 3, "！", 3) ||
                !memcmp(end - 3, "？", 3) || !memcmp(end - 3, "，", 3) ||
                !memcmp(end - 3, "；", 3) || !memcmp(end - 3, "：", 3)))
        {
          end -= 3;
        }
      else
        {
          break;
        }
    }

  /* Product phrases are explicit camera-consent triggers, never substrings. */
  return ((size_t)(end - begin) == sizeof(first) - 1 &&
          !memcmp(begin, first, sizeof(first) - 1)) ||
         ((size_t)(end - begin) == sizeof(second) - 1 &&
          !memcmp(begin, second, sizeof(second) - 1));
}
#endif
static int resolve_endpoint(struct bkcloud_runtime_s *r)
{
  struct addrinfo hints={0};
  struct addrinfo *addresses=NULL;
  hints.ai_family=AF_INET;
  hints.ai_socktype=SOCK_STREAM;
  int error=getaddrinfo(r->config.host,NULL,&hints,&addresses);
  int ret=error == EAI_AGAIN ? -EAGAIN : -EHOSTUNREACH;
  if(!error)
    {
      for(struct addrinfo *p=addresses;p;p=p->ai_next)
        {
          if(p->ai_family!=AF_INET || !p->ai_addr ||
             p->ai_addrlen<sizeof(struct sockaddr_in)) continue;
          struct in_addr address=((struct sockaddr_in *)p->ai_addr)->sin_addr;
          uint32_t value=ntohl(address.s_addr);
          if(!value || value>=0xe0000000u) continue;
          /* The worker exclusively owns TLS before its first connection.
           * Keep certificate hostname and persisted trust unchanged.
           */
          r->tls.config.peer_address=address;
          ret=0;
          break;
        }
    }
  if(addresses) freeaddrinfo(addresses);
  return cancelled(r) ? -ECANCELED : ret;
}
static void *work(void *context)
{
  struct bkcloud_runtime_s *r=context;
  struct bkcloud_client_s *client=calloc(1,sizeof(*client));
  struct bkcloud_tts_s *decoder=NULL;
  struct bkcloud_playback_s *play=NULL;
#ifdef CONFIG_BK7258_VISION_SERVICE
  uint8_t *jpeg=NULL;
  size_t jpeg_size=0;
#endif
  int ret=-ENOMEM;
  if(!client) goto out;
  uint64_t deadline=bkvoice_config_now_ms(NULL)+90000;
  if(cancelled(r)) {ret=-ECANCELED;goto out;}
  ret=resolve_endpoint(r);
  if(ret) goto out;
  if(r->probe)
    {
      ret=bkcloud_chat(client,&r->config,bkvoice_tls_ops(),&r->tls,deadline,
                       "Reply with OK.",&r->history,"Connection check.",
                       r->reply,sizeof(r->reply));
      goto out;
    }
  ret=bkcloud_recognize(client,&r->config,bkvoice_tls_ops(),&r->tls,deadline,
                        r->pcm,r->pcm_size,r->input,sizeof(r->input));
  if(ret) goto out;
  if(cancelled(r)) {ret=-ECANCELED;goto out;}
  char prompt[512];
  persona_prompt(r,prompt,sizeof(prompt));
#ifdef BKCLOUD_MEMORY_RUNTIME
  if (r->memory_bound && !r->memory_restored && !r->memory_uncertain)
    {
      int memory_ret = r->memory_known && !r->memory_enabled ? 0 : memory_process(r, false);
      r->memory_restored = true;
      if (memory_ret) syslog(LOG_WARNING, "BKVOICE CLOUD memory_restore=%d\n", memory_ret);
    }
#endif
#ifdef CONFIG_BK7258_VISION_SERVICE
  if (camera_consent(r->input))
    {
      /* Persona/history restoration may have consumed the remaining turn
       * budget. Recheck before acquiring a new physical camera frame too.
       */
      if (cancelled(r) || bkvoice_config_now_ms(NULL) >= deadline)
        {
          ret=cancelled(r) ? -ECANCELED : -ETIMEDOUT;
          goto out;
        }
      jpeg=calloc(1,BKCLOUD_JPEG_MAX);
      if (!jpeg)
        {
          ret=-ENOMEM;
          goto out;
        }
      ret=bk7258_vision_capture_jpeg(jpeg,BKCLOUD_JPEG_MAX,&jpeg_size);
      if (!ret && (cancelled(r) || bkvoice_config_now_ms(NULL) >= deadline))
        {
          ret=cancelled(r) ? -ECANCELED : -ETIMEDOUT;
        }
      if (!ret)
        {
          ret=bkcloud_understand_jpeg(client,&r->config,bkvoice_tls_ops(),
              &r->tls,deadline,prompt,&r->history,r->input,jpeg,jpeg_size,
              r->reply,sizeof(r->reply));
        }
      mbedtls_platform_zeroize(jpeg,BKCLOUD_JPEG_MAX);
      free(jpeg);
      jpeg=NULL;
    }
  else
#endif
    ret=bkcloud_chat(client,&r->config,bkvoice_tls_ops(),&r->tls,deadline,
        prompt,
        &r->history,r->input,r->reply,sizeof(r->reply));
  if(ret) goto out;
  if(cancelled(r)) {ret=-ECANCELED;goto out;}
  decoder=calloc(1,sizeof(*decoder));play=calloc(1,sizeof(*play));
  if(!decoder || !play) {ret=-ENOMEM;goto out;}
  ret=bkcloud_synthesize_turn(client,decoder,play,&r->ptt->turn,&r->config,
                               bkvoice_tls_ops(),&r->tls,deadline,
                               bkvoice_config_now_ms,NULL,r->reply);
out:
#ifdef CONFIG_BK7258_VISION_SERVICE
  if(jpeg) {mbedtls_platform_zeroize(jpeg,BKCLOUD_JPEG_MAX);free(jpeg);}
#endif
  if(client) {mbedtls_platform_zeroize(client,sizeof(*client));free(client);}
  if(decoder) {bkcloud_tts_clear(decoder);free(decoder);}
  if(play) {mbedtls_platform_zeroize(play,sizeof(*play));free(play);}
  r->result=ret;
  __atomic_store_n(&r->done,true,__ATOMIC_RELEASE);
  if(r->wake) sem_post(r->wake);
  return NULL;
}
static int launch(struct bkcloud_runtime_s *r,bool probe)
{
  if(r->joinable) return -EBUSY;
  struct bkvoice_tls_config_s config={
    .peer_address=r->trust->peer_address,.server_ca=&r->trust->ca,
    .trusted_time=bkvoice_config_trusted_time,.now_ms=bkvoice_config_now_ms,
    .clock_context=r->trust,.server_auth_only=true};
  int ret=bkvoice_tls_initialize(&r->tls,&config);
  if(ret) return ret;
  pthread_attr_t attr;
  ret=pthread_attr_init(&attr);
  if(ret) {bkvoice_tls_uninitialize(&r->tls);return -ret;}
  ret=pthread_attr_setstacksize(&attr,16384);
  r->memory_job=false;
  r->probe=probe;__atomic_store_n(&r->cancelled,false,__ATOMIC_RELEASE);r->result=0;
  __atomic_store_n(&r->done,false,__ATOMIC_RELEASE);
  if(!ret) ret=pthread_create(&r->worker,&attr,work,r);
  pthread_attr_destroy(&attr);
  if(ret) {bkvoice_tls_uninitialize(&r->tls);return -ret;}
  r->joinable=true;return 0;
}
#ifdef BKCLOUD_MEMORY_RUNTIME
static void *memory_work(void *context)
{
  struct bkcloud_runtime_s *r = context;
  int ret;
  if (r->memory_action == MEMORY_SAVE) ret = memory_process(r, true);
  else
    {
      struct bkcloud_memory_policy_s policy;
      ret = __atomic_load_n(&g_memory_policy_uncertain, __ATOMIC_ACQUIRE) ? -EINPROGRESS : 0;
      if (!ret && r->memory_action != MEMORY_READ_POLICY)
        {
          mbedtls_entropy_context entropy;
          mbedtls_entropy_init(&entropy);
          ret = bkcloud_memory_policy_set("/cpdata/shaniu/memory-policy", r->memory_owner,
              r->memory_action == MEMORY_ENABLE,
              r->memory_action == MEMORY_DELETE, mbedtls_entropy_func, &entropy);
          mbedtls_entropy_free(&entropy);
        }
      /* Uncertain publication must not become success by same-boot readback. */
      if (!ret) ret = bkcloud_memory_policy_load("/cpdata/shaniu/memory-policy",
                                                 r->memory_owner, &policy);
      if (!ret)
        {
          r->memory_known = true; r->memory_enabled = policy.enabled;
          if (r->memory_action == MEMORY_ENABLE) r->memory_restored = r->history.count != 0;
          if (r->memory_action == MEMORY_DELETE)
            { bkcloud_history_clear(&r->history); r->memory_restored = true; }
        }
      else
        {
          r->memory_known = false; r->memory_enabled = false;
          if (ret == -EINPROGRESS)
            {
              r->memory_uncertain = true;
              __atomic_store_n(&g_memory_policy_uncertain, true, __ATOMIC_RELEASE);
            }
        }
      mbedtls_platform_zeroize(&policy, sizeof(policy));
    }
  r->result = ret; r->memory_error = ret;
  __atomic_store_n(&r->done, true, __ATOMIC_RELEASE);
  if (r->wake) sem_post(r->wake);
  return NULL;
}
static int memory_launch(struct bkcloud_runtime_s *r, enum memory_action_e action)
{
  pthread_attr_t attr;
  int ret = pthread_attr_init(&attr);
  if (ret) return -ret;
  ret = pthread_attr_setstacksize(&attr, 16384);
  r->memory_job = true; r->memory_action = action;
  __atomic_store_n(&r->done, false, __ATOMIC_RELEASE);
  if (!ret) ret = pthread_create(&r->worker, &attr, memory_work, r);
  pthread_attr_destroy(&attr);
  if (ret) { r->memory_job = false; return -ret; }
  r->joinable = true;
  return 0;
}
#endif
static int reap(struct bkcloud_runtime_s *r)
{
  if(!r->joinable) return 0;
  if(!__atomic_load_n(&r->done,__ATOMIC_ACQUIRE)) return -EAGAIN;
  int ret=pthread_join(r->worker,NULL);
  if(ret) return -ret;
  r->joinable=false;
  ret=r->memory_job ? 0 : bkvoice_tls_uninitialize(&r->tls);
  return ret;
}
int bkcloud_runtime_create(struct bkcloud_runtime_s **output,
                            const void *record,size_t size,
                            struct bkvoice_config_s *trust,
                            struct bkvoice_ptt_s *ptt,sem_t *wake)
{
  if(!output || *output || !trust || !trust->initialized || !ptt) return -EINVAL;
  struct bkcloud_runtime_s *r=calloc(1,sizeof(*r));
  if(!r) return -ENOMEM;
  int ret=bkcloud_config_decode(&r->config,record,size);
  if(!ret && (strcmp(r->config.host,trust->host) || r->config.port!=trust->port)) ret=-EINVAL;
  if(ret) {mbedtls_platform_zeroize(r,sizeof(*r));free(r);return ret;}
  r->trust=trust;r->ptt=ptt;r->wake=wake;*output=r;return 0;
}
int bkcloud_runtime_connect(struct bkcloud_runtime_s *r)
{ return r ? launch(r,true) : -EINVAL; }
int bkcloud_runtime_ready(struct bkcloud_runtime_s *r)
{
  if(!r) return -EINVAL;
  if(r->ready) return 1;
  int ret=reap(r);
  if(ret==-EAGAIN) return 0;
  if(ret) return ret;
  if(r->result) return r->result;
  if(!r->probe || !r->done) return -ENOTCONN;
  if(r->ptt->turn.last_session_id>=UINT32_MAX-1) return -EOVERFLOW;
  ret=bkvoice_ptt_session_open(r->ptt,r->ptt->turn.last_session_id+1,&capture_ops,r);
  if(ret) return ret;
  r->ready=true;wipe_text(r);return 1;
}
int bkcloud_runtime_clear(struct bkcloud_runtime_s **runtime)
{
  if(!runtime || !*runtime) return 0;
  struct bkcloud_runtime_s *r=*runtime;
  if(r->joinable)
    {
      __atomic_store_n(&r->cancelled,true,__ATOMIC_RELEASE);
      if (!r->memory_job) bkvoice_tls_ops()->interrupt(&r->tls);
      int ret=reap(r);if(ret) return ret;
    }
  int ret=bkvoice_ptt_session_close(r->ptt,-ECANCELED);
  if(ret) return ret;
  wipe_audio(r);mbedtls_platform_zeroize(r,sizeof(*r));free(r);*runtime=NULL;
  return 0;
}
bool bkcloud_runtime_busy(const struct bkcloud_runtime_s *r)
{ return r && (r->joinable || r->pressed || r->automatic_capture ||
               r->pending_history || r->cancel_requested); }
int bkcloud_runtime_memory_owner(struct bkcloud_runtime_s *r, const uint8_t owner[32])
{
  if (!r || !owner) return -EINVAL;
  /* Idempotent refresh must not touch a worker's borrowed identity/history. */
  if (r->memory_bound && !memcmp(r->memory_owner, owner, 32)) return 0;
  if (!r->ready || bkcloud_runtime_busy(r) || r->ptt->worker_joinable ||
      r->ptt->turn.state != BKVOICE_TURN_IDLE) return -EBUSY;
  uint8_t bits = 0;
  for (size_t i = 0; i < 32; i++) bits |= owner[i];
  if (!bits) return -EINVAL;
  bkcloud_history_clear(&r->history);
  memcpy(r->memory_owner, owner, 32);
  r->memory_bound = true; r->memory_restored = false; r->memory_enabled = false;
  r->memory_known = false; r->memory_error = 0; r->memory_uncertain = false;
#ifdef BKCLOUD_MEMORY_RUNTIME
  int ret = memory_launch(r, MEMORY_READ_POLICY);
  if (ret) { r->memory_bound = false; return ret; }
#endif
  return 0;
}
int bkcloud_runtime_memory_set(struct bkcloud_runtime_s *r, bool enabled, bool erase)
{
#ifndef BKCLOUD_MEMORY_RUNTIME
  (void)r; (void)enabled; (void)erase; return -ENOTSUP;
#else
  if (!r || !r->ready || !r->memory_bound) return -ENOTCONN;
  if (bkcloud_runtime_busy(r) || r->ptt->worker_joinable ||
      r->ptt->turn.state != BKVOICE_TURN_IDLE) return -EBUSY;
  if (r->memory_uncertain || __atomic_load_n(&g_memory_policy_uncertain, __ATOMIC_ACQUIRE)) return -EINPROGRESS;
  return memory_launch(r, erase ? MEMORY_DELETE : enabled ? MEMORY_ENABLE : MEMORY_DISABLE);
#endif
}
int bkcloud_runtime_clear_history(struct bkcloud_runtime_s *r)
{
  if(!r || !r->ready) return -ENOTCONN;
  if(bkcloud_runtime_busy(r) || r->ptt->worker_joinable ||
     r->ptt->turn.state != BKVOICE_TURN_IDLE) return -EBUSY;
  bkcloud_history_clear(&r->history);
  r->memory_restored = true;
  wipe_text(r);
  return 0;
}
int bkcloud_runtime_auto_begin(
  struct bkcloud_runtime_s *r,
  bkvoice_capture_prefill_read_t read_frame, void *prefill_context,
  size_t prefill_frames, bkvoice_capture_live_observer_t live_observer,
  void *live_context)
{
  struct bkvoice_turn_token_s token;
  int ret;

