open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_cloud_runtime.c
  if (!r || !r->ready)
    {
      return -ENOTCONN;
    }

  if (read_frame == NULL || prefill_frames == 0 ||
      prefill_frames > BKVOICE_CAPTURE_MAX_PREFILL_FRAMES ||
      (live_observer == NULL && live_context != NULL))
    {
      return -EINVAL;
    }

  if (r->automatic_capture || r->joinable || r->memory_job ||
      r->cancel_requested || r->pending_history || r->pressed || r->pcm ||
      r->ptt->worker_joinable ||
      r->ptt->turn.state != BKVOICE_TURN_IDLE)
    {
      return -EBUSY;
    }

  r->automatic_capture = true;
  r->armed = false;
  r->pcm = malloc(BKCLOUD_PCM_MAX);
  if (r->pcm == NULL)
    {
      r->automatic_capture = false;
      return -ENOMEM;
    }

  ret = bkvoice_ptt_down_prefill(
    r->ptt, bkvoice_config_now_ms(NULL), read_frame, prefill_context,
    prefill_frames, live_observer, live_context, &token);
  if (ret < 0 && r->ptt->worker_joinable)
    {
      /* The capture worker may still hold the sink PCM.  Preserve it until
       * step() has completed the normal cancel/stop/join sequence, but do
       * not let this failed automatic turn reach launch().
       */

      r->cancel_requested = true;
    }
  else if (ret < 0)
    {
      r->automatic_capture = false;
      wipe_audio(r);
    }

  return ret;
}
int bkcloud_runtime_auto_end(struct bkcloud_runtime_s *r)
{
  int ret;

  if (!r || !r->ready)
    {
      return -ENOTCONN;
    }

  if (!r->automatic_capture)
    {
      return -EPERM;
    }

  if (r->cancel_requested)
    {
      return -ECANCELED;
    }

  ret = bkvoice_ptt_up(r->ptt, bkvoice_config_now_ms(NULL));
  if (ret < 0)
    {
      if (r->ptt->worker_joinable)
        {
          return ret;
        }

      (void)bkvoice_ptt_cancel(r->ptt, ret);
      r->automatic_capture = false;
      r->armed = false;
      wipe_audio(r);
      return ret;
    }

  r->automatic_capture = false;
  if (r->pcm_size != 0)
    {
      ret = launch(r, false);
    }
  else
    {
      ret = -ENODATA;
    }

  if (ret < 0)
    {
      (void)bkvoice_ptt_cancel(r->ptt, ret);
      r->armed = false;
      wipe_audio(r);
    }

  return ret;
}
int bkcloud_runtime_cancel(struct bkcloud_runtime_s *r)
{
  if(!r || !r->ready) return -ENOTCONN;
  r->cancel_requested=true;
  r->armed=false;
  if(r->joinable)
    {
      __atomic_store_n(&r->cancelled,true,__ATOMIC_RELEASE);
      if (!r->memory_job) bkvoice_tls_ops()->interrupt(&r->tls);
    }
  return 0;
}
int bkcloud_runtime_cancel_drain(struct bkcloud_runtime_s *r)
{
  int ret;

  if (!r || !r->ready) return -ENOTCONN;
  if (!r->cancel_requested)
    {
      ret = bkcloud_runtime_cancel(r);
      if (ret < 0) return ret;
    }

  /* The cancellation branch ignores input epochs while work is borrowed.
   * Use a neutral disconnected input so completion cannot re-arm capture. */
  bkcloud_runtime_step(r, false, false, r->epoch);
  return bkcloud_runtime_busy(r) ? -EAGAIN : 0;
}
void bkcloud_runtime_status(const struct bkcloud_runtime_s *r,
                            struct bkcloud_runtime_status_s *status)
{
  memset(status,0,sizeof(*status));
  status->turn_state = UINT32_MAX;
  if(!r) return;
  status->ready=r->ready;
  status->armed=r->armed;
  status->pressed=r->pressed;
  status->busy=bkcloud_runtime_busy(r);
  status->worker_active=r->joinable;
  status->turn_state=r->joinable ? UINT32_MAX : (uint32_t)r->ptt->turn.state;
  if(!r->joinable) status->last_error=r->ptt->turn.last_error;
#ifdef BKCLOUD_MEMORY_RUNTIME
  status->memory_supported = true;
  status->memory_pending = r->joinable && r->memory_job;
  if (!r->joinable)
    {
      status->memory_known = r->memory_known;
      status->memory_enabled = r->memory_known && r->memory_enabled;
      status->memory_failed = r->memory_error != 0;
    }
#endif
}
void bkcloud_runtime_step(struct bkcloud_runtime_s *r,bool link,bool level,uint32_t epoch)
{
  if(!r || !r->ready) return;
  if (r->joinable && r->memory_job)
    {
      if (reap(r)) return;
      syslog(LOG_NOTICE, "BKVOICE CLOUD memory_action=%u result=%d\n", r->memory_action, r->result);
      r->memory_job = false;
      r->armed = link && !level;
      return;
    }
  bool changed=r->epoch!=epoch;
  r->epoch=epoch;
  if(r->cancel_requested)
    {
      if(r->joinable)
        {
          __atomic_store_n(&r->cancelled,true,__ATOMIC_RELEASE);
          bkvoice_tls_ops()->interrupt(&r->tls);
          if(reap(r)) return;
        }
      int ret=bkvoice_ptt_cancel(r->ptt,-ECANCELED);
      if(ret || r->ptt->worker_joinable) return;
      wipe_audio(r);wipe_text(r);r->pressed=false;r->automatic_capture=false;
      r->cancel_requested=false;
      /* A held key must be released before a new capture can start. */
      r->armed=link && !level;
      return;
    }
  if(r->joinable)
    {
      if(cancelled(r) || !link || changed || (level && r->armed))
        {__atomic_store_n(&r->cancelled,true,__ATOMIC_RELEASE);bkvoice_tls_ops()->interrupt(&r->tls);r->armed=false;}
      if(!level) r->armed=true;
      int ret=reap(r);
      if(ret) return;
      wipe_audio(r);
      if(r->result || r->cancelled)
        {
          bkvoice_ptt_cancel(r->ptt,r->result ? r->result : -ECANCELED);
          syslog(LOG_WARNING,"BKVOICE CLOUD turn_fail=%d\n",r->result ? r->result : -ECANCELED);
          wipe_text(r);
        }
      else r->pending_history=true;
    }
  if (r->automatic_capture)
    {
      if (!link || changed)
        {
          int ret = bkvoice_ptt_cancel(r->ptt, -ENOTCONN);
          r->armed = false;
          if (ret || r->ptt->worker_joinable)
            {
              return;
            }

          wipe_audio(r);
          wipe_text(r);
          r->automatic_capture = false;
          return;
        }

      int ret = bkvoice_ptt_timeout(r->ptt, bkvoice_config_now_ms(NULL));
      if (ret != -EAGAIN && !r->ptt->worker_joinable)
        {
          wipe_audio(r);
          r->automatic_capture = false;
          r->armed = false;
        }

      return;
    }
  if(!link || changed)
    {
      int ret=bkvoice_ptt_cancel(r->ptt,-ENOTCONN);
      r->armed=false;
      if(ret || r->ptt->worker_joinable) return;
      wipe_audio(r);wipe_text(r);r->pressed=false;return;
    }
  if(r->pending_history)
    {
      if(r->ptt->turn.state != BKVOICE_TURN_IDLE &&
         bkvoice_config_now_ms(NULL) >= r->ptt->turn.deadline_ms)
        {
          (void)bkvoice_ptt_timeout(r->ptt,bkvoice_config_now_ms(NULL));
          if(r->ptt->turn.state == BKVOICE_TURN_IDLE)
            wipe_text(r);
          r->armed=false;
          return;
        }
      int ret=bkvoice_turn_poll(&r->ptt->turn);
      if(ret || r->ptt->turn.state==BKVOICE_TURN_IDLE)
        {
          if(!ret && !r->ptt->turn.last_error)
            {
              ret=bkcloud_history_commit(&r->history,r->input,r->reply);
#ifdef BKCLOUD_MEMORY_RUNTIME
              if (!ret && r->memory_enabled)
                {
                  int memory_ret = memory_launch(r, MEMORY_SAVE);
                  if (memory_ret) syslog(LOG_WARNING, "BKVOICE CLOUD memory_launch=%d\n", memory_ret);
                }
#endif
            }
          syslog(LOG_NOTICE,"BKVOICE CLOUD playback_complete=%d\n",ret==0 && !r->ptt->turn.last_error);
          wipe_text(r);
        }
      if(level && r->armed) {bkvoice_ptt_cancel(r->ptt,-ECANCELED);wipe_text(r);r->armed=false;}
      if(!level) r->armed=true;
      return;
    }
  if(!level)
    {
      if(r->pressed)
        {
          int ret=bkvoice_ptt_up(r->ptt,bkvoice_config_now_ms(NULL));
          if(r->ptt->worker_joinable) return;
          r->pressed=false;
          if(!ret && r->pcm_size) ret=launch(r,false);
          else if(!ret) ret=-ENODATA;
          if(ret) {bkvoice_ptt_cancel(r->ptt,ret);wipe_audio(r);}
        }
      r->armed=true;
    }
  else if(r->armed && !r->pressed)
    {
      r->armed=false;
      if(r->ptt->turn.state!=BKVOICE_TURN_IDLE || r->ptt->worker_joinable) return;
      r->pcm=malloc(BKCLOUD_PCM_MAX);
      struct bkvoice_turn_token_s token;
      int ret=r->pcm ? bkvoice_ptt_down(r->ptt,bkvoice_config_now_ms(NULL),&token) : -ENOMEM;
      if(!ret || r->ptt->worker_joinable) r->pressed=true;else wipe_audio(r);
    }
  if(r->pressed)
    {
      int ret=bkvoice_ptt_timeout(r->ptt,bkvoice_config_now_ms(NULL));
      if(ret != -EAGAIN && !r->ptt->worker_joinable)
        {wipe_audio(r);r->pressed=false;r->armed=false;}
    }
}
